WiKi/README.tex
% Created 2019-05-31 vie 10:12
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{fixltx2e}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{float}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{marvosym}
\usepackage{wasysym}
\usepackage{amssymb}
\usepackage{hyperref}
\tolerance=1000
\author{Miguel Molinos Pérez}
\date{\today}
\title{GeHoJerez}
\hypersetup{
  pdfkeywords={},
  pdfsubject={},
  pdfcreator={Emacs 25.2.2 (Org mode 8.2.10)}}
\begin{document}

\maketitle
\tableofcontents

This is a simple MPM code write in C, the main purpose of this code is to understand the basics concepts of a MPM code. I also write this lines to keep some order in my ideas during this crazy years. 

Miguel Molinos Pérez, PhD candidate. Madrid 28-5-2019

\section{Physical problem}
\label{sec-1}

\subsection{Balance of momentum (Equilibrium)}
\label{sec-1-1}

\begin{equation}
\rho \cdot \partial_{t} v + \partial_{x} \sigma =  \rho \cdot b
\end{equation}



\subsection{Compatibility}
\label{sec-1-2}
\subsection{Constitutive response}
\label{sec-1-3}

\begin{equation}
\sigma = 2G\epsilon + \lambda tr(\epsilon) I
\end{equation}

\section{Material Point Method}
\label{sec-2}

\subsection{Explicit MPM Scheme}
\label{sec-2-1}

\begin{enumerate}
\item Calculate the grid nodal mass and momentum by maping the particle mass and momentum to the corresponding grid nodes.
\end{enumerate}
\begin{equation}
m_{I}^{k} = \sum^{n_p}_{p=1} m_p N_{Ip}^{k}
\end{equation} 
\begin{equation}
p_{I,i}^{k-1/2} = \sum^{n_p}_{p=1} m_p v_{ip}^{k-1/2}N_{Ip}^{k}
\end{equation}
\begin{enumerate}
\item Impose essential boundary conditions on the grid nodal momentum. At the fixed boundary, set $p_{iI}^{k-1/2} = 0$.
\item For the USF only, calculate the particle strain increment $\Delta \epsilon_{ijp}^{k-1/2}$, and the update the particle density and stress as follows:
\begin{itemize}
\item Calculate the grid nodal velocity $v_{iI}^{k-1/2}$
\begin{equation}
v_{iI}^{k-1/2} = \frac{p_{iI}^{k-1/2}}{m_I^k}
\end{equation}
\item Calculate the particle strain increment $\Delta \epsilon_{ijp}^{k-1/2}$ with :
\begin{equation}
\Delta \epsilon_{ijp}^{k-1/2} = \frac{1}{2}(N_{Ip,j}^{k} v_{iI}^{k-1/2} + N_{Ip,i}^{k} v_{jI}^{k-1/2})
\end{equation}
\item Update the particle density with :
\begin{equation}
\rho_p^{k+1} = \frac{\rho_p^k}{1 + \Delta\epsilon_{iip}^{k-1/2}}
\end{equation}
\item Update the particle stress stated based on $\Delta_{ijp}^{k-1/2}$ with an appropriate constitutive law.
\end{itemize}
\end{enumerate}

\section{Proposed tests}
\label{sec-3}

\subsection{Simple propagation of a shock wave in a 1D media}
\label{sec-3-1}

Here we solve the transport equation with a time integrator called Two-Step Taylor-Galerkin that stabilize the solution avoiding the formation of spurious oscillations during the transport. For the spatial discretization will be used 1D li

$\partial$$_{\text{t}}$ u + c $\cdot$ $\partial$$_{\text{x}}$ u = 0

The algorithm is as follows : 
\begin{enumerate}
\item Transfer information to the Gauss-Points :  u$^{\text{n}}_{\text{GP}}$ = $\sum$$^{\text{N}}_{\text{i=0}}$N(x$_{\text{i}}$) $\cdot$ u$^{\text{n}}_{\text{i}}$
\item Get the solution in the Gauss-Points for t = n + 1/2 : u$^{\text{n+1/2}}_{\text{GP}}$ = u$^{\text{n}}_{\text{GP}}$ - $\Delta$ t/2 $\cdot$ $\sum$$^{\text{N}}_{\text{i=0}}$ $\partial$ N(x$_{\text{i}}$) $\cdot$ u$^{\text{n}}_{\text{i}}$
\item Get the solution in the nodes for t = n + 1 :
\end{enumerate}

\subsection{Simple propagation of a shock wave in a 1D elastic media using the formulation $\sigma$ - v}
\label{sec-3-2}


\section{Items}
\label{sec-4}

\subsection{{\bfseries\sffamily DONE} Get the Nodal coordinates of the material points}
\label{sec-4-1}

\subsubsection{23-05-2019, Madrid}
\label{sec-4-1-1}

\subsection{{\bfseries\sffamily DONE} Get the strain increment in the material points}
\label{sec-4-2}

\subsubsection{28-05-2019, Madrid}
\label{sec-4-2-1}
\subsection{{\bfseries\sffamily DONE} Get the stress state}
\label{sec-4-3}
% Emacs 25.2.2 (Org mode 8.2.10)
\end{document}